import 'package:get/get.dart';

class MyTranslation extends Translations{
  @override
  // TODO: implement keys
  Map<String, Map<String, String>> get keys => {
    'ar' : {
      '1' : 'اللغة العربية',
      '2' : 'اللغة الانجليزية',
      '3' : 'اختر اللغة المناسبة',
      "4": "نحن لدينا 100 الف منتج  , اختر \n  منتجك  من  متجرنا",
      "5": "سهل وامن للشراء",
      "6": "يمكنك الدفع كاش او \n من خلال بوابات الدفع الالكترونية",
      "7": "تتبع طلبك",
      "8": "يمكنك تتبع طلبك في كل مرحلة \n وايضا التتبع من خلال الخريطة",
      "9": "متابعه",
      "10": "تسجيل الدخول",
      "11": "اهلا بك",
      "12":
      "يمكنك تسجيل الدخول من خلال البريد وكلمة المرور او من خلال وسائل التواصل الاجتماعي",
      "13": "ادخل البريد الالكتروني",
      "14": "ادخل كلمة المرور",
      "15": "هل نسيت كلمة المرور",
      "16": "تسجيل الدخول",
      "17": "ليس لديك حساب ? ",
      "18": "انشاء حساب",
      "19": "البريد الالكتروني",
      "20": "كلمة المرور",
      "21": "اسم المستخدم",
      "22": "رقم الهاتف",
      "23": "ادخل رقم الهاتف",
      "24": "ادخل اسم المستخدم",
      "25":
      "انشاء حساب من خلال البريد وكلمة المرور او من خلال وسائل التواصل الاجتماعي",
      "26": " لديك حساب ? ",
      "27": "تسجيل الدخول",
      "28": "فحص البريد الالكتروني",
      "29": "تم انشاء الحساب بنجاح",
      "30": "الرجاء ادخال البريد لتلقي رمز التحقق",
      "31": "فحص",
      "32": "الذهاب لتسجيل الدخول",
      "33": "نجاح",
      "34": "حفظ",
      "35": "الرجاء ادخال كلمة المرور الجديدة",
      "36": "الكلمة الجديدة",
      "37": "تم اعادة تعيين كلمة المرور بنجاح",
      "38": "تهانينا",
      "39": "تم التسجيل بنجاح"
    },
    'en' : {
      '1' : 'Ar',
      '2' : 'EN',
      '3' : 'Choose Language',
    },
  };
}